{
  "en": [
    "The quick brown fox jumps over the lazy dog. This pangram contains all the letters of the English alphabet. It is commonly used for touch-typing practice. Typing is an essential skill in today's digital world. Regular practice can help improve your speed and accuracy.",
    "Programming is the process of creating a set of instructions that tell a computer how to perform a task. Programming can be done using a variety of computer programming languages, such as JavaScript, Python, and C++.",
    "The Internet is a global network of computers connected to each other which communicate through a standardized set of protocols. It has revolutionized the way we communicate, learn, work, and entertain ourselves.",
    "Artificial intelligence is the simulation of human intelligence processes by machines, especially computer systems. These processes include learning, reasoning, and self-correction. AI is being used in various fields including healthcare, finance, and transportation."
  ],
  "ne": [
    "नेपाली भाषा नेपालको आधिकारिक भाषा हो। यो भाषा नेपालका अतिरिक्त भारतको सिक्किम, पश्चिम बंगाल, असम र अन्य राज्यहरूमा पनि बोलिन्छ। नेपाली भाषा देवनागरी लिपिमा लेखिन्छ। नेपाली भाषामा टाइपिङ अभ्यास गर्नाले तपाईंको गति र सटीकता सुधार गर्न मद्दत गर्दछ।",
    "नेपाल एक सुन्दर देश हो जहाँ हिमाल, पहाड र तराई तीन भौगोलिक क्षेत्रहरू छन्। यहाँ विश्वको सबैभन्दा अग्लो हिमाल सगरमाथा छ। नेपालमा विविध संस्कृति, भाषा र परम्पराहरू पाइन्छन्। यो प्राकृतिक सौन्दर्यले भरिपूर्ण छ।",
    "कम्प्युटर एक यस्तो उपकरण हो जसले डाटा प्रोसेसिङ गर्दछ। आजको डिजिटल युगमा कम्प्युटर हाम्रो जीवनको अभिन्न अंग बनेको छ। कम्प्युटरमा टाइपिङ गर्न सक्ने क्षमता एक महत्वपूर्ण सीप हो जसले हाम्रो कार्यक्षमता बढाउँछ।"
  ],
  "es": [
    "El veloz zorro marrón salta sobre el perro perezoso. Este pangrama contiene todas las letras del alfabeto español. Es comúnmente utilizado para la práctica de mecanografía. La mecanografía es una habilidad esencial en el mundo digital actual.",
    "España es un país situado en la península ibérica en el suroeste de Europa. Es conocido por su rica cultura, su deliciosa gastronomía y sus hermosas playas. El español es el segundo idioma más hablado del mundo por número de hablantes nativos.",
    "La tecnología ha transformado la forma en que vivimos, trabajamos y nos comunicamos. Los avances tecnológicos han mejorado la calidad de vida de muchas personas, pero también han planteado nuevos desafíos y preocupaciones."
  ],
  "fr": [
    "Portez ce vieux whisky au juge blond qui fume. Ce texte contient toutes les lettres de l'alphabet français. Il est couramment utilisé pour la pratique de la dactylographie. La dactylographie est une compétence essentielle dans le monde numérique d'aujourd'hui.",
    "La France est connue pour sa cuisine, sa mode, son art et sa culture. Paris, sa capitale, est célèbre pour ses monuments comme la Tour Eiffel, l'Arc de Triomphe et la cathédrale Notre-Dame. Le français est parlé par environ 300 millions de personnes dans le monde.",
    "L'apprentissage d'une nouvelle langue peut être difficile mais gratifiant. Cela vous permet de communiquer avec plus de personnes et de mieux comprendre différentes cultures. La pratique régulière est essentielle pour améliorer vos compétences linguistiques."
  ],
  "de": [
    "Victor jagt zwölf Boxkämpfer quer über den großen Sylter Deich. Dieser Satz enthält alle Buchstaben des deutschen Alphabets. Er wird häufig zum Üben des Maschinenschreibens verwendet. Maschinenschreiben ist eine wesentliche Fertigkeit in der heutigen digitalen Welt.",
    "Deutschland ist für seine Ingenieurskunst, seine Autos und sein Bier bekannt. Es hat eine reiche Geschichte und Kultur. Die deutsche Sprache wird von etwa 130 Millionen Menschen weltweit gesprochen und ist eine der wichtigsten Sprachen in der Europäischen Union.",
    "Das Internet hat die Art und Weise, wie wir kommunizieren, lernen und arbeiten, revolutioniert. Es hat uns Zugang zu einer Fülle von Informationen verschafft und die Welt zu einem globalen Dorf gemacht. Die digitale Kompetenz ist in der heutigen Gesellschaft unerlässlich."
  ]
}
